from py2neo import Graph

class Config(object):
    def __init__(self, port):
        self.graph = Graph("http://172.24.4.101:" + port, auth=("neo4j", "ad_neo4j"))
        self.keywords_dict = {
        '患者身份信息': ['患者身份信息','个人生物信息'],
        '员工身份信息': ['员工身份信息'],
        '其他身份信息': ['其他身份'],
        '检查检验数据': ['检查检验','检查项目','检查登记','检查','检验','检查项目明细','检验结果'],
        '护理数据': ['护理','护理数据','护理记录'],
        '病历数据': ['病历数据','病历','门诊病历','住院病历'],
        '病程数据': ['病程数据','病程','病程信息','病程记录'],
        '病人回访数据': ['病人回访','反映情况登记'],
        '用药数据': ['用药','处方明细','用药医嘱','用药信息','患者用药信息','药物基本信息'],
        '手术数据': ['手术','手术记录','手术登记','手术过程',' MET_OPS'],
        '麻醉数据': ['麻醉','麻醉记录'],
        '输血数据': ['输血','血液','血型','输血记录'],
        '住院数据': ['住院数据','住院记录','住院医嘱'],
        '出院数据': ['出院','出院数据'],
        '科研相关': ['科研','科研成果管理'],
        '日常数据': ['日常'],
        '培训相关': ['培训','轮转信息'],
        '物资相关': ['物资','入库','出库','盘点','库房参数','药品入库申请','药品调价批次','药品基本信息','药品借药还药明细', '中标', '招标', '清算','调价','药品调价明细','药品调价','药品日结'],
        '后勤相关': ['后勤', '膳食菜单','膳食基本项目明细'],
        '财务相关': ['结算员日结', '财务', '欠费','结算员日结明细','门诊收款日结'],
        '人力资源相关': ['人力资源','人员数据','人员','员工代码','员工信息变更','人员数据台帐'],
        '科室数据': ['科室','科室设置','药物科室设置','科室信息'],
        '医院信息': ['医院信息','医院基本信息'],
        '医疗交易信息': ['费用', '结算', '住院费用', '门诊结算', '账单','预交金','住院费用汇总','交易记录','膳食交易记录','膳食结算信息','膳食预交金','膳食明细'],
        '保险信息': ['保险','社会保险'],
        '病史信息': ['病史','现病史','家族史','既往史','过敏史'],
        '体检信息': ['体检','体检信息']
        }
        
        self.fg_path = '/home/tzy/Classification/datas/fg.json'
        self.db_path = '/home/tzy/Classification/datas/db.json'
        self.ys_path = '/home/tzy/Classification/datas/映射表.json'
        
        self.content_path = '/home/tzy/Classification/datas/test.csv'
